fio/log_38/sdk/fio_randwrite_64k.log
test: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=35102: Thu Jul 12 17:53:14 2018
  write: IOPS=424, BW=26.5MiB/s (27.8MB/s)(1024MiB/38577msec)
    slat (nsec): min=4091, max=79239, avg=25927.97, stdev=11509.38
    clat (usec): min=579, max=1068.2k, avg=150626.61, stdev=131515.33
     lat (usec): min=624, max=1068.3k, avg=150652.90, stdev=131516.61
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   17], 10.00th=[   22], 20.00th=[   32],
     | 30.00th=[   64], 40.00th=[   94], 50.00th=[  120], 60.00th=[  148],
     | 70.00th=[  182], 80.00th=[  236], 90.00th=[  338], 95.00th=[  430],
     | 99.00th=[  558], 99.50th=[  651], 99.90th=[  743], 99.95th=[  785],
     | 99.99th=[ 1062]
   bw (  KiB/s): min= 4726, max=61696, per=99.04%, avg=26921.03, stdev=9500.83, samples=77
   iops        : min=   73, max=  964, avg=420.62, stdev=148.48, samples=77
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.10%, 10=0.93%, 20=7.50%, 50=18.63%
  lat (msec)   : 100=15.36%, 250=38.71%, 500=16.41%, 750=2.24%, 1000=0.08%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.52%, sys=1.65%, ctx=15713, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,16384,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=26.5MiB/s (27.8MB/s), 26.5MiB/s-26.5MiB/s (27.8MB/s-27.8MB/s), io=1024MiB (1074MB), run=38577-38577msec

Disk stats (read/write):
  sdk: ios=42/15588, merge=0/626, ticks=22914/2365653, in_queue=2402247, util=99.79%